
#*3.1列表
#列表list是由一系列按特定顺序排列的元素组成的。你可以将任何东西加入列表中，且列表中通常包含多个元素，因此可以给列表指定一个表示复数的名称，比如letters
#在派森中，用方括号[]表示列表，用逗号分隔其中的元素
#列表中的元素可以是字符串，可以是数字，可以是任何东西
#可以将列表赋值给变量
l=['haruga','chihaya','miki']
print(l)



#?访问列表元素/索引从0而不是1开始
#列表是有序集合，要访问元素，只需要将元素的位置（索引）告诉python
#访问元素，可以指出列表名称，再在后面打上方括号，方括号内指出元素的索引即可
#!索引即为元素的顺序，在python中，从左往右第一位元素的索引为0。负数则表示为从右往左的位置，倒数，比如[-1]就是指列表中最后一个元素。索引可以是数字，也可以是数字赋值了的变量
#!索引数决不能越界，否则将会报错
k=['00001','sun','moon']
print(int(k[0]),k[2].title())        #索引选中的列表中的元素，当然可以进行方法操作
m=[12,0.3,0.08]
print(m[1]*m[2],'\nt.title()')       #依旧引号内的是纯文本，注意了



#?使用列表中的各个值
#把提取列表的元素，也当做正常元素，也可以和f字符串，方法等一系列合作
girls=['ling','xi','nian','jie','shu']
sentence=f'My love is belong to {girls[0].title()}!'
print(sentence)