
#*3.2修改、添加和删除元素
#大多数列表都是动态的，这意味着列表创建后，将会进行许多变化的操作



#?修改列表元素
#修改的语法与访问的语法类似，要修改列表元素，可以直接指定选定元素索引，再赋予新值
bands=['mygo','avemujica','mewtype','millsage']
bands[3]='mama'
print(bands)



#?添加列表元素
#*1.在列表末尾添加元素
#通过方法.append(添加内容)，以实现。
mygo=['高松灯','千早爱音','长崎素世','要乐奈']
mygo.append('椎名立希')
print(mygo)

#*2.在列表中插入元素
#通过方法.insert(索引位置，插入内容)，以实现。
#这个插入的意思是，在插入后，你插入的元素将会到你指定的索引位，而不是指原先的索引位。
project=['chihaya','haruga','miki']
project.insert(3,'nami')
print(project)
#这种操作可以理解为，先将所有既有元素先都向右移一个位置，然后在选定插入的索引位上，如果有元素，就将此元素及其左侧所有元素向左移一位补空。



#?从列表中删除元素
#*1.使用del语句删除元素
#del 列表变量[索引位]
project=['chihaya','haruga','miki']
del project[1]
print(project)

#*2.使用pop()方法删除元素
#变量.pop(抽取索引位)，有返回值
#术语弹出（pop）源自这样的类比：列表就像一个栈，而删除列表末尾的元素就相当于弹出栈顶元素
#.pop() 是列表（List）的一个非常核心的方法。用大白话来说，它的作用就是：“从列表中拿出一个元素，并把它删掉。”
#它是一个既修改原列表，又有返回值的方法。
#修改原列表：它会把元素从列表里踢出去。
#有返回值：被踢出去的那个元素，你可以用变量接住它。
#!当括号内不填任何参数时，.pop() 默认会删除并返回列表的最后一个元素。
#如果你写了 x = tools.pop()，这个元素就搬家到了变量 x 里，你依然可以使用它。
#!如果你只写了 tools.pop()，没有变量去接它，那这个元素就被抛弃了，Python 的垃圾回收机制会把它从内存里彻底清除。
#!用编程的严谨术语来说，变量 = 列表.pop() 这个操作完成了两个原子动作：
#!移交所有权：把最后一个元素的值“复制”给了左边的变量。
#!原地剔除：把它从原列表中“物理移除”，列表长度永久减 1。
project=['chihaya','haruga','miki']
p=project.pop(1)
print(project)
print(p)
#!判断标准：如果要从列表中删除一个元素，且以后不再以任何方式使用它，就用del语句；如果要在删除元素后继续使用它，就用pop()方法

#*4.根据值删除元素
#通过.remove(剔除变量的值)方法，以实现。无返回值
#删除的变量，你可以通过使其赋值为一个新的变量，来保留
project=['chihaya','haruga','miki']
project.remove('miki')
print(project)
#如果列表里有多个相同的值，.remove() 只会干掉第一个，后面的它不管。如果你要全删，得用循环。
#!.remove()是一个无返回值的方法，直接print(变量.remove('值‘))会无返回值，会输出none！这点不同于.pop()！
#!你可以把“返回值”理解为函数执行完毕后，交给你的“结果”。
#在 Python 里，方法的设计分为两大类，这牵扯到“字符串不可变”和“列表可变”的底层机制：
#“原地修改”型（通常返回 None）：
#比如列表的 .remove()、.append()、.sort()。它们直接在“原列表”身上动刀子，原地修改了数据。它们不需要给你一个结果，因为结果就是你手里的原列表。所以它们返回值是 None（类似于“无”）。
#通俗理解：你让厨师把厨房里的烂苹果扔了，厨师扔了（原列表变了），没必要再拿个烂苹果给你。
#“制造新东西”型（通常有返回值）：
#比如字符串的 .title()、.upper()、.strip()。字符串本身是“不可变”的，它们不能修改原字符串，只能根据原字符串，算出一个“新字符串”交给你。
#通俗理解：你让厨师拿面粉做碗面条，厨师原封不动保留了面粉（原字符串没变），把面条（返回值）端给了你。
l1=['sun','moon','earth']
print(l1.pop(0))

l2=['sun','moon','earth']
s='sun'
print(l2.remove(s))         #!对比明显，两种方法，有无返回值，输出结果的变化！