
#*5.4使用if语句处理列表



#?检查特殊元素
#使if语句嵌套进for，对每个元素都进行操作
l=['令','年','夕']
for g in l:
    if g == '令':
        print(f'这是{g}')
    else:
        print(f'这不是令，这是{g}')
print(f'使用结束')



#?确定列表非空
#对于数值0、空值None、单引号空字符串''、双引号空字符串""、空列表[]、空元组（）、空字典{}，python都会返回False
#有时候，我们需要假设列表为空，即里面一个元素也没有，即做好列表为空与非空的两手准备
l=[]
if l:
    for n in l:
        print(f'这里有个{n}')
else:
    print(f'这里啥也木有')



#?使用多个列表
#如果一个列表中有池子里没有的角色，如何辨别呢？
pool=['艾雅法拉','玛恩纳','白铁','陈','银灰','能天使','凯尔希','灵知']
wanted=['艾雅法拉','令','白铁','陈','棘刺','能天使','凯尔希','锏']
for s in wanted:
    if s not in pool:
        print(f'哎，怎么池子里没有{s}啊！')
    else:
        print(f'可以,这池子里有{s}')


