#Python编程：从入门到实践，这本书的每一章节例题，我都会以文件形式，文件名区分，来编写学习
message="i love you"
print(message)
coke="xiaomaolaodi"
print(coke)
#所以说，变量的意思是你只要写个任意字母，加个等号，左边就是变量，右边就是你打的东西的“值”，然后再输出时，就不需要再打上下引号了
#变量名只能包含：字母、数字、下划线。变量名能以字母或下划线打头，但不能以数字打头。可：lover_1 or _1lover不可：1_lover（这有问题啊，为什么下划线也不对？？）
#变量名不可以用 空格 ！只能用下划线分隔（书是这么说，但为啥我下划线都不能用？）
#不要用python关键字和函数名作变量名，比如print，这很好理解
#保持简洁且准确
#慎用小写的字母例如l和o，因为很难区别她们与1和0（笑）




message1="you"
print(message1)
message1coke="homework"
print(message1coke)
#我发现，好像只能字母加数字，下划线加不了，甚至数字打头都不行，为啥？？？！
