
#*2.4数
#Python中可以进行数值计算



#?整数
#!加法：+
#!减法：-
#!乘法：*
#!除法：/
#!乘方：**
#!在给变量赋值数字时，数字不能以0打头，只能输入单个0,因为 0 开头在程序语言里有着极其特殊的含义——代表八进制（Octal），python会误解！
#!八进制：必须加 0o（小写字母 o），比如 0o311
#!二进制：必须加 0b，比如 0b101（代表十进制的 5）
#!十六进制：必须加 0x，比如 0x1A（代表十进制的 26）
#!1.合法/.5合法/0合法/0.1合法/
#!科学记数法1e100，e后面只能是整数
#!int() 函数非常聪明，它能识别字符串里的前导零，并自动把它按十进制处理掉
#!



#?浮点数
#派森将带小数点的数称为浮点数（float)
#结果包含的小数位数可能是不确定的
#print内可以直接进行计算，从而输出结果
print(3*0.1)



#?整数和浮点数
#任意两个数相除，结果总是浮点数，即便这两个数都是整数且能整除
print(4/2)
#在其他任何运算中，如果一个操作数是整数，另一个操作数是浮点数，结果也总是浮点数
print(2*3.0)



#?数中的下划线
#书写很大的数时，可以使用下划线将其中的数位分组，使其更加清晰易读
#当你输出这些数时，python不会输出下划线
number=114_514_1919_810
print(number)
#下划线表示既适用于整数，也适用于浮点数
n=1.0_086
n1=1_8.0086
print(n)
print(n1)
#!下划线不能写在小数点左右
#!下划线不能打头
#!下划线不能结尾



#?同时给多个变量赋值
#可在一行代码里给多个变量赋值，有助于缩短程序并提高可续性
#操作时，需要用逗号将变量名隔开，值亦然。python会按照顺序将每个值赋给对应变量。只要变量数的值的个数相同，就不会有问题
x,y,z=0,0,0
print(f'{x}\n{y}\n{z}')
print(x,y,z)
#虽然说是类似将多步赋值操作整合成一步，但多变量赋值能做到一些单变量赋值做不到的事情
#比如变量转换
a=1
b=2
a,b=b,a     #单步无法做到，因为会有顺序问题，无法同时覆盖新值
print(a,b)



#?常量
#常量是在程序的整个生命周期内都保持不变的量。
#通常以全大写字母，来表示常量（可用下划线）。其值始终不变
CONSTANT=114514