
#*4.3创建数值列表
#列表非常适合用于存储数值集合



#?使用range()函数
#range()函数能让你轻松生成一系列数
#range（）就是一个数字生成器
for n in range(1,5):
    print(n)
#从结果来看，输出结果只会到99，到了99就会结束，而不会继续输出100
#这是编程语言中常见的差一行为的结果，即输出结果通常不包含最后一个数
#因此，如果想输出n个数，应当在range（）函数右侧打入n+1
for n in range(5):
    print(n)
#直接输入range(5)相当于range(0,5)，输出结果是从0到4，不包含5.



#?使用range（）创建数值列表
#要创建数值列表，可使用list（）函数将range()的结果直接转换为列表。
#如果将range（）作为list()的参数，输出将是一个数值列表
n=list(range(1,6))
print(n)
#!对于range(m,n,s)而言：
#!1个参数：从0开始，到n结束（不含n）。
#!2个参数：从m开始，到n结束（不含n）。
#!3个参数：从m开始，每次跨s，直到n结束（不含n）。
#!永远记住：左闭右开（起点算，终点不算）；步长为负，倒着往回算。

#创建一个列表，其中包含前十整数的平方
l=[]
for n in range(1,11):
    n=n**2
    l.append(n)
print(l)

l=[]
for n in range(1,11):
    l.append(n**2)
print(l)