
#*4.3创建数值列表
#列表非常适合用于存储数值集合



#?使用range()函数
#range()函数能让你轻松生成一系列数
#range（）就是一个数字生成器
for n in range(1,5):
    print(n)
#从结果来看，输出结果只会到99，到了99就会结束，而不会继续输出100
#这是编程语言中常见的差一行为的结果，即输出结果通常不包含最后一个数
#因此，如果想输出n个数，应当在range（）函数右侧打入n+1
for n in range(5):
    print(n)
#直接输入range(5)相当于range(0,5)，输出结果是从0到4，不包含5.



#?使用range（）创建数值列表
#要创建数值列表，可使用list（）函数将range()的结果直接转换为列表。
#如果将range（）作为list()的参数，输出将是一个数值列表
n=list(range(1,6))
print(n)
#!对于range(m,n,s)而言：
#!1个参数：从0开始，到n结束（不含n）。
#!2个参数：从m开始，到n结束（不含n）。
#!3个参数：从m开始，每次跨s，直到n结束（不含n）。
#!永远记住：左闭右开（起点算，终点不算）；步长为负，倒着往回算。

#创建一个列表，其中包含前十整数的平方
l=[]
for n in range(1,11):
    n=n**2
    l.append(n)
print(l)

l=[]
for n in range(1,11):
    l.append(n**2)
print(l)
#for内的，就已经算是类似print的操作了，往下的方法函数都会执行，只是不print的话你会看不到，但实质上都是存在的。倒不如说直接写个方法或函数才是最正统的代码



#?对数值列表执行简单的统计计算
#!min(数值列表)
#!max(数值列表)
#!sum(数值列表)



#?列表推导式
#列表推导式（list comprehension）将for循环和创建新元素的代码合并成一行，并自动追加新元素
#python魔法
l=[n**2 for n in range(1,11)]
print(l)
#!注意，此处for循环最后并没有冒号
#列表推导式的运算速度会比分布快，这是其优势之一
#!标准公式：变量=[对变量做什么操作 for 变量 in 原可迭代对象 if 筛选条件]
#!print(l=[n**2 for n in range(1,11)])这行代码，同时执行了print的打印任务和l=[]的赋值任务，两任务冲突，会报错
#为什么 reverse=True 行，而你的 l=... 不行？
#因为 reverse 是 sorted 函数本来就设计好、专门支持的参数。而 l 只是你临时起意取的名字，print 函数的说明书里没有 l 这个参数，所以它拒绝了。