
#*4.4使用列表的一部分
#处理列表的一部分，称为切片（slice）



#?切片
#要创建切片，可指定要使用的第一个元素和最后一个元素的索引。与range()函数一样，切片不会输出最后一个元素
#语法：序列[开始索引 : 结束索引 : 步长] （start : stop : step）
#如无指定，则默认从列表开头开始提取[:4]
#如果要让切片终止于列表末尾，可使用[3:]
#负数代表从末尾开始数的索引数，因此[-3:]代表从倒数第三个元素到末尾的切片
#[:],相当于从头截到尾，复制一遍
#默认步长是 1（挨个取）。
#步长为正：从左往右，每次跳 step 个。
#tools[::2] -> ['地铁', '电车', '火箭']（隔一个取一个）
#步长为负（绝杀技巧）：从右往左倒着切。注意：步长为负时，start 必须大于 stop，否则切出来是空的！
#tools[::-1] -> ['火箭', '直升机', '电车', '自行车', '地铁']（完成整个列表的反转）
#有返回值
gamers=['xrmiside','amiside','千夏','ash']
print(gamers[::-1])



#?遍历切片
