
#*4.4使用列表的一部分
#处理列表的一部分，称为切片（slice）



#?切片
#切片方括号置于列表变量之后
#要创建切片，可指定要使用的第一个元素和最后一个元素的索引。与range()函数一样，切片不会输出最后一个元素
#!语法：序列[开始索引 : 结束索引 : 步长] （start : stop : step）
#如无指定，则默认从列表开头开始提取[:4]
#如果要让切片终止于列表末尾，可使用[3:]
#负数代表从末尾开始数的索引数，因此[-3:]代表从倒数第三个元素到末尾的切片
#[:],相当于从头截到尾，复制一遍
#默认步长是 1（挨个取）。
#步长为正：从左往右，每次跳 step 个。
#tools[::2] -> ['地铁', '电车', '火箭']（隔一个取一个）
#!步长为负（绝杀技巧）：从右往左倒着切。注意：步长为负时，start 必须大于 stop，否则切出来是空的！
#tools[::-1] -> ['火箭', '直升机', '电车', '自行车', '地铁']（完成整个列表的反转）
#!有返回值
gamers=['xrmiside','amiside','千夏','ash']
print(gamers[::-1])



#?遍历切片
#如果要遍历列表的部分元素，可在for循环中使用切片
gamers=['xrmiside','amiside','千夏','ash']
print(f'得分前三名：')
for g in gamers[0:3]:
    print(g.title())
    
    
    
#?复制列表
#使用[:]即可
#注意，使用切片复制，即新变量=旧变量[:]，实际上生成了两个独立的变量。就相当于把旧变量的副本赋值给了新变量
#而如果你直接新变量=旧变量，那么其实这二者会不断覆盖，值都一样，相当于给旧变量改成了新变量的名字，并不独立，如果你想要两个独立的结果，那么应该避免这样做。
