
#*5.1，if语句一个简单示例
girls=['haruka','chihaya','miki']
for g in girls:
    if g == "miki":
        print(g.upper())
    else:
        print(g.title())
        
#语法格式
#if 条件1:
#    执行代码1
#elif 条件2:      # elif 是 else if 的缩写
#    执行代码2
#else:
#    执行代码3
#!冒号不要忘
#!每个要素间的空格不要忘
#!注意缩进

#!在写条件时，你会经常用到比较运算符：
# ==：等于（⚠️ 致命避坑：判断相等是两个等号！一个等号 = 是赋值！）
# !=：不等于
# >、<、>=、<=：大于、小于、大于等于、小于等于
#组合条件（逻辑运算符）：
#and：两个条件都为真，结果才为真。
#or：只要有一个条件为真，结果就为真。
#not：取反（not True 就是 False）。
#专属检查（强烈推荐）：
#in / not in：检查某个元素是否在列表中（非常适合检查任务是否在队列里，或者障碍物是否在视野里）。
#在 Python 中，万物皆可判断真假：
#假（Falsy）：False、0、0.0、""（空字符串）、[]（空列表）、()（空元组）、None。
#真（Truthy）：除了上面那些，剩下的基本都是真。非空列表、非零数字、非空字符串。