
#*使用字典
#字典用大括号 {} 表示。它里面存的是“键值对”（Key-Value Pair）。
#在python中，字典（dictionary）是一系列 键值对 。每个键都与一个值关联，可以使用键来访问与之相关联的值。
#与键相关联的可以是数、字符串、列表乃至字典（套娃？）。事实上，可将任意python对象用作字典中的值
#用花括号{}来表示字典，其中包括一系列键值
#键值对包含两个相互关联的值。键和值之间用冒号分隔，而键值对之间用逗号分隔。在字典中，你想存多少个键值对都可以
#键就相当于字典的条目，是你用以查询的唯一指标。而值则是字典里对于条目的解释与定义，定义可以是任何形式，无所谓，但值终究只是键的附庸



#?访问字典中的值
d={'first': '如月千早',
   'second': 1,
}
print(d['first'])
print(f'\n')
#就是相当于原本用中括号索引选取列表元素，现在换为键直接去字典对应值
#!索引直接输键名，结果就是键对应的值！就相当于靠键来找值！！



#?添加键值对
#在字典中，添加键值对通过：字典[添加键]=添加值 来实现。最终排序顺序和添加顺序一致。
key={'red':'haruka',
     'blue':'chihaya',
     'yellow':'miki',
     'mama':'azusa'
}
key['white']='takane'
print(key)
print(f'\n')



#?从创建一个空字典开始
#有时，在空字典中添加键值对很方便，甚至是必须
key={}
key['红色系']='天海春香'
key['苍系']='如月千早'
print(key)
print(f'\n')



#?修改字典中的值
#修改字典中的值，可以直接指定需要修改的值的键，通过方括号直接赋予新值
#指定时，即在方括号内的得用键名找，而赋值还是要用新值
#字典[键名]=需要改的新值
key={'红色系':'天海春香'}
key['红色系']='岛村卯月'
print(f'我最喜欢的小偶像是{key['红色系']}')
print(f'\n')

player={'x':0,
        'y':24,
        'speed':'fast'
        }
print(f'原先位置x坐标为{player['x']}')
s1=1
s2=2
s3=3
if player['speed'] =='fast':
   player['x']=player['x']+s3
elif player['speed'] =='slow':
   player['x']=player['x']+s2
else:
   player['x']=player['x']+s1
print(f'现在玩家位置位于x坐标{player['x']}')
print(f'\n')



#?删除键值对
#对于不需要的信息，可使用del语句
#del 字典[键名]
#注意，使用del语句时，必须指定字典名和要删除的键
key={'red':'haruka',
     'blue':'chihaya',
     'yellow':'miki',
     'mama':'azusa'
}
del key['red']
print(key)
print(f'\n')



#?由类似的对象组成的字典
#相似对象多的话，用分行，但不要忘了冒号、逗号、以及每行的缩进要对齐



#?使用get()来访问值
#使用方括号内的键来获取值，在键不存在（未定义）的情况下，会出现问题，会报错
#为避免，可以用.get（）方法在需要的键不存在时，返回一个默认值
#.get()方法第一个参数用以指定键，必不可少。第二个参数为当指定的值不存在时要返回的值，是可选的。
#如果第一个参数（键）已经存在，且它本身有值，那么你再输入第二个参数（默认值），Python 会完全无视第二个参数，直接输出原本的那个值。
#!.get()方法不修改字典的任何东西！只是拿出来看，如果没有，那就返回一个默认值，但绝对不会修改！！！！！
#.get()方法有返回值
key={'red':'haruka',
     'blue':'chihaya',
     'yellow':'miki',
     'mama':'azusa'
}
print(key.get('white','四条贵音'))
print(key.get('red','四条贵音'))
#如果制定的键有可能不存在，则应使用.get()方法，而不是用方括号表示法
#比如用户没有输入值时，则需要用get来保证有一个默认值