
#*使用字典
#字典用大括号 {} 表示。它里面存的是“键值对”（Key-Value Pair）。
#在python中，字典（dictionary）是一系列 键值对 。每个键都与一个值关联，可以使用键来访问与之相关联的值。
#与键相关联的可以是数、字符串、列表乃至字典（套娃？）。事实上，可将任意python对象用作字典中的值
#用花括号{}来表示字典，其中包括一系列键值
#键值对包含两个相互关联的值。键和值之间用冒号分隔，而键值对之间用逗号分隔。在字典中，你想存多少个键值对都可以
#键就相当于字典的条目，是你用以查询的唯一指标。而值则是字典里对于条目的解释与定义，定义可以是任何形式，无所谓，但值终究只是键的附庸



#?访问字典中的值
d={'first': '如月千早',
   'second': 1,
}
print(d['first'])
print(f'\n')
#就是相当于原本用中括号索引选取列表元素，现在换为键直接去字典对应值



#?添加键值对
#在字典中，添加键值对通过：字典[添加键]=添加值 来实现。最终排序顺序和添加顺序一致。
key={'red':'haruka',
     'blue':'chihaya',
     'yellow':'miki',
     'mama':'azusa'
}
key['white']='takane'
print(key)
print(f'\n')



#?从创建一个空字典开始
#有时，在空字典中添加键值对很方便，甚至是必须
key={}
key['红色系']='天海春香'
key['苍系']='如月千早'
print(key)
print(f'\n')



#?修改字典中的值
#修改字典中的值，可以直接指定需要修改的值的键，通过方括号直接赋予新值
#指定时，即在方括号内的得用键名找，而赋值还是要用新值
#字典[键名]=需要改的新值
key={'红色系':'天海春香'}
key['红色系']='岛村卯月'
print(f'我最喜欢的小偶像是{key['红色系']}')
print(f'\n')



#?